# Getting Financial Data - Pandas Datareader

### Introduction:

This time you will get data from a website.


### Step 1. Import the necessary libraries

In [106]:
import pandas as pd
import numpy as np
import pandas_datareader.data as web
import datetime as dt
import json

In [107]:
import yfinance as yf

### Step 2. Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is).

In [108]:
# Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is).
start = dt.datetime(2015, 1, 1)
end = dt.datetime.today()

### Step 3. Get an API key for one of the APIs that are supported by Pandas Datareader, preferably for AlphaVantage.

If you do not have an API key for any of the supported APIs, it is easiest to get one for [AlphaVantage](https://www.alphavantage.co/support/#api-key). (Note that the API key is shown directly after the signup. You do *not* receive it via e-mail.)

(For a full list of the APIs that are supported by Pandas Datareader, [see here](https://pydata.github.io/pandas-datareader/readers/index.html). As the APIs are provided by third parties, this list may change.)

### Step 4. Use Pandas Datarader to read the daily time series for the Apple stock (ticker symbol AAPL) between 01/01/2015 and today, assign it to df_apple and print it.

In [109]:
df_apple = yf.download('AAPL', start, end)
df_apple.head()

[*********************100%%**********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close     Volume
Date
2015-01-02  27.847500  27.860001  26.837500  27.332500  24.402170  212818400
2015-01-05  27.072500  27.162500  26.352501  26.562500  23.714727  257142000
2015-01-06  26.635000  26.857500  26.157499  26.565001  23.716957  263188400
2015-01-07  26.799999  27.049999  26.674999  26.937500  24.049522  160423600
2015-01-08  27.307501  28.037500  27.174999  27.972500  24.973557  237458000

### Step 5. Add a new column "stock" to the dataframe and add the ticker symbol

In [110]:
df_apple['stock'] = 'AAPL'
df_apple.head()

,Open,High,Low,Close,Adj Close,Volume,stock
Date,,,,,,,
2015-01-02,27.847500,27.860001,26.837500,27.332500,24.402170,212818400,AAPL
2015-01-05,27.072500,27.162500,26.352501,26.562500,23.714727,257142000,AAPL
2015-01-06,26.635000,26.857500,26.157499,26.565001,23.716957,263188400,AAPL
2015-01-07,26.799999,27.049999,26.674999,26.937500,24.049522,160423600,AAPL
2015-01-08,27.307501,28.037500,27.174999,27.972500,24.973557,237458000,AAPL

### Step 6. Repeat the two previous steps for a few other stocks, always creating a new dataframe: Tesla, IBM and Microsoft. (Ticker symbols TSLA, IBM and MSFT.)

In [111]:
df_tsla = yf.download('TSLA',start,end)
df_ibm = yf.download('IBM',start,end)
df_msft = yf.download('MSFT',start,end)

df_tsla['stock'] = 'TSLA'
df_ibm['stock'] = 'IBM'
df_msft['stock'] = 'MSFT'

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

### Step 7. Combine the four separate dataFrames into one combined dataFrame df that holds the information for all four stocks

In [112]:
df = pd.concat([df_apple,df_tsla,df_ibm,df_msft])
df.head()

,Open,High,Low,Close,Adj Close,Volume,stock
Date,,,,,,,
2015-01-02,27.847500,27.860001,26.837500,27.332500,24.402170,212818400,AAPL
2015-01-05,27.072500,27.162500,26.352501,26.562500,23.714727,257142000,AAPL
2015-01-06,26.635000,26.857500,26.157499,26.565001,23.716957,263188400,AAPL
2015-01-07,26.799999,27.049999,26.674999,26.937500,24.049522,160423600,AAPL
2015-01-08,27.307501,28.037500,27.174999,27.972500,24.973557,237458000,AAPL

### Step 8. Shift the stock column into the index (making it a multi-level index consisting of the ticker symbol and the date).

In [113]:
df['Date'] = df.index
df = df.set_index(['Date','stock'],drop=True)
df

,,Open,High,Low,Close,Adj Close,Volume
Date,stock,,,,,,
2015-01-02,AAPL,27.847500,27.860001,26.837500,27.332500,24.402170,212818400
2015-01-05,AAPL,27.072500,27.162500,26.352501,26.562500,23.714727,257142000
2015-01-06,AAPL,26.635000,26.857500,26.157499,26.565001,23.716957,263188400
2015-01-07,AAPL,26.799999,27.049999,26.674999,26.937500,24.049522,160423600
2015-01-08,AAPL,27.307501,28.037500,27.174999,27.972500,24.973557,237458000
...,...,...,...,...,...,...,...
2024-05-08,MSFT,408.170013,412.230011,406.709991,410.540009,410.540009,11792300
2024-05-09,MSFT,410.570007,412.720001,409.100006,412.320007,412.320007,14689700
2024-05-10,MSFT,412.940002,415.380005,411.799988,414.739990,414.739990,13402300
2024-05-13,MSFT,418.010010,418.350006,410.820007,413.720001,413.720001,15440200
2024-05-14,MSFT,412.019989,417.489990,411.549988,416.559998,416.559998,15042700

### Step 7. Create a dataFrame called vol, with the volume values.

In [138]:
vol = df['Volume']
vol = vol.copy()
vol

Date        stock
2015-01-02  AAPL     212818400
2015-01-05  AAPL     257142000
2015-01-06  AAPL     263188400
2015-01-07  AAPL     160423600
2015-01-08  AAPL     237458000
                       ...
2024-05-08  MSFT      11792300
2024-05-09  MSFT      14689700
2024-05-10  MSFT      13402300
2024-05-13  MSFT      15440200
2024-05-14  MSFT      15042700
Name: Volume, Length: 9428, dtype: int64

### Step 8. Aggregate the data of volume to weekly.
Hint: Be careful to not sum data from the same week of 2015 and other years.

In [139]:
vol = vol.reset_index(drop=False,inplace=False)
vol

           Date stock     Volume
0    2015-01-02  AAPL  212818400
1    2015-01-05  AAPL  257142000
2    2015-01-06  AAPL  263188400
3    2015-01-07  AAPL  160423600
4    2015-01-08  AAPL  237458000
...         ...   ...        ...
9423 2024-05-08  MSFT   11792300
9424 2024-05-09  MSFT   14689700
9425 2024-05-10  MSFT   13402300
9426 2024-05-13  MSFT   15440200
9427 2024-05-14  MSFT   15042700

[9428 rows x 3 columns]

In [140]:
vol['year'] = vol['Date'].dt.year
vol['week'] = vol['Date'].dt.strftime("%V")
vol

           Date stock     Volume  year week
0    2015-01-02  AAPL  212818400  2015   01
1    2015-01-05  AAPL  257142000  2015   02
2    2015-01-06  AAPL  263188400  2015   02
3    2015-01-07  AAPL  160423600  2015   02
4    2015-01-08  AAPL  237458000  2015   02
...         ...   ...        ...   ...  ...
9423 2024-05-08  MSFT   11792300  2024   19
9424 2024-05-09  MSFT   14689700  2024   19
9425 2024-05-10  MSFT   13402300  2024   19
9426 2024-05-13  MSFT   15440200  2024   20
9427 2024-05-14  MSFT   15042700  2024   20

[9428 rows x 5 columns]

In [141]:
vol.drop(columns='Date',inplace=True)
vol

     stock     Volume  year week
0     AAPL  212818400  2015   01
1     AAPL  257142000  2015   02
2     AAPL  263188400  2015   02
3     AAPL  160423600  2015   02
4     AAPL  237458000  2015   02
...    ...        ...   ...  ...
9423  MSFT   11792300  2024   19
9424  MSFT   14689700  2024   19
9425  MSFT   13402300  2024   19
9426  MSFT   15440200  2024   20
9427  MSFT   15042700  2024   20

[9428 rows x 4 columns]

In [142]:
vol = vol.groupby(['stock','year','week']).sum()
vol

                     Volume
stock year week
AAPL  2015 01     212818400
           02    1133010000
           03    1216906400
           04     794948000
           05    1863370800
...                     ...
TSLA  2024 16     461788900
           17     649063900
           18     628370700
           19     377983200
           20     153250100

[1960 rows x 1 columns]

### Step 9. Find all the volume traded in the year of 2015

In [157]:
### Step 9. Find all the volume traded in the year of 2015
new_df = vol.loc[['AAPL', 'TSLA', 'IBM', 'MSFT'],(2015),:].groupby('stock').sum()
new_df

            Volume
stock
AAPL   52264199600
IBM     1156439400
MSFT    9059455900
TSLA   16323267000